CSI API ETABS v1
cGridSys.GetGridSys_2 Method
 Retrieves the grid system specified by the Name item.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetGridSys_2(
	string Name,
	ref double Xo,
	ref double Yo,
	ref double RZ,
	ref string GridSysType,
	ref int NumXLines,
	ref int NumYLines,
	ref string[] GridLineIDX,
	ref string[] GridLineIDY,
	ref double[] OrdinateX,
	ref double[] OrdinateY,
	ref bool[] VisibleX,
	ref bool[] VisibleY,
	ref string[] BubbleLocX,
	ref string[] BubbleLocY
)
Function GetGridSys_2 (
	Name As String,
	ByRef Xo As Double,
	ByRef Yo As Double,
	ByRef RZ As Double,
	ByRef GridSysType As String,
	ByRef NumXLines As Integer,
	ByRef NumYLines As Integer,
	ByRef GridLineIDX As String(),
	ByRef GridLineIDY As String(),
	ByRef OrdinateX As Double(),
	ByRef OrdinateY As Double(),
	ByRef VisibleX As Boolean(),
	ByRef VisibleY As Boolean(),
	ByRef BubbleLocX As String(),
	ByRef BubbleLocY As String()
) As Integer
Dim instance As cGridSys
Dim Name As String
Dim Xo As Double
Dim Yo As Double
Dim RZ As Double
Dim GridSysType As String
Dim NumXLines As Integer
Dim NumYLines As Integer
Dim GridLineIDX As String()
Dim GridLineIDY As String()
Dim OrdinateX As Double()
Dim OrdinateY As Double()
Dim VisibleX As Boolean()
Dim VisibleY As Boolean()
Dim BubbleLocX As String()
Dim BubbleLocY As String()
Dim returnValue As Integer
returnValue = instance.GetGridSys_2(Name,
	Xo, Yo, RZ, GridSysType, NumXLines,
	NumYLines, GridLineIDX, GridLineIDY,
	OrdinateX, OrdinateY, VisibleX, VisibleY,
	BubbleLocX, BubbleLocY)
int GetGridSys_2(
	String^ Name,
	double% Xo,
	double% Yo,
	double% RZ,
	String^% GridSysType,
	int% NumXLines,
	int% NumYLines,
	array<String^>^% GridLineIDX,
	array<String^>^% GridLineIDY,
	array<double>^% OrdinateX,
	array<double>^% OrdinateY,
	array<bool>^% VisibleX,
	array<bool>^% VisibleY,
	array<String^>^% BubbleLocX,
	array<String^>^% BubbleLocY
)
abstract GetGridSys_2 :
        Name : string *
        Xo : float byref *
        Yo : float byref *
        RZ : float byref *
        GridSysType : string byref *
        NumXLines : int byref *
        NumYLines : int byref *
        GridLineIDX : string[] byref *
        GridLineIDY : string[] byref *
        OrdinateX : float[] byref *
        OrdinateY : float[] byref *
        VisibleX : bool[] byref *
        VisibleY : bool[] byref *
        BubbleLocX : string[] byref *
        BubbleLocY : string[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing grid system.
Xo
Type: System.Double
 The global X grid of the origin of the grid system. [L]
Yo
Type: System.Double
 The global Y grid of the origin of the grid system. [L]
RZ
Type: System.Double
 The rotation of an axis of the new grid system relative to the global grid system is defined as follows: (1) Rotate the grid system about the positive global Z-axis as defined by the RZ item. [deg]
GridSysType
Type: System.String
NumXLines
Type: System.Int32
NumYLines
Type: System.Int32
GridLineIDX
Type: System.String[]
GridLineIDY
Type: System.String[]
OrdinateX
Type: System.Double[]
OrdinateY
Type: System.Double[]
VisibleX
Type: System.Boolean[]
VisibleY
Type: System.Boolean[]
BubbleLocX
Type: System.String[]
BubbleLocY
Type: System.String[]
Return Value
Type: Int32
 Returns zero if the grid system data is successfully retrieved, otherwise it returns a nonzero value.
Remarks
Examples
See Also
Reference
cGridSys Interface
ETABSv1 Namespace